app/views/users/_form.html.erb

SELECT "courses".* FROM "courses"
---
                    <li class="list-group-item">
                        <%= select_tag(:course_id, options_for_select(Course.all.map {|c| [c.name, c.id]}, :selected => @user.course_id), {:class => "form-select profile", :include_blank => "Course of study", :size => 1 })%>