app/views/users/_user.html.erb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
                        <strong>Your course:</strong>
                        <%= Course.find(user.course_id).name%>

SELECT "books".* FROM "books" INNER JOIN "books_users" ON "books"."id" = "books_users"."book_id" WHERE "books_users"."user_id" = ?  [["user_id", 3]]
---
                <ul class="list-group list-group-flush">
                    <% user.book.each do |book|%>