app/views/books/_book_show.html.erb

SELECT "books".* FROM "books" INNER JOIN "books_users" ON "books"."id" = "books_users"."book_id" WHERE "books_users"."user_id" = ? AND "books"."id" = ?  [["user_id", 6], ["id", 1]]
---
    <%= link_to addToFavorites_path(@book.id), id: "favorite-link", class: "favourites-link" do%>
      <%if current_user.book.where(id: @book.id).blank?%>

SELECT "authors".* FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 1]]
---
        <td>
          <% @book.author.each do|author| %>