app/views/books/_form.html.erb

SELECT "categories".* FROM "categories"
---
      <div class="d-flex" id="select-div" style="flex-direction:column">
        <%= select_tag(:categories, options_for_select(Category.all.map {|cat| [cat.name, cat.id]}), {:class => "selectpicker", :include_blank => true,  :multiple => true, :size => 5 })%>