app/views/books/_form.html.erb

    <%= form.label :authors, style: "display: block" %>
    <%= select_tag(:authors, options_for_select(Author.all.map {|aut| [aut.name, aut.id]}, :selected => @book.author_ids), {:class => "selectpicker", :include_blank => true,  :multiple => true, :size => 5 })%>
---
SELECT "authors"."id" FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 1]]

    <%= form.label :categories, "Course of study", style: "display: block" %>
    <%= select_tag(:categories, options_for_select(Category.where("isCourse = true").map {|cat| [cat.name, cat.id]}, :selected => @book.category_ids), {:class => "selectpicker", :include_blank => true,  :multiple => true, :size => 5 })%>
---
SELECT "courses"."id" FROM "courses" INNER JOIN "books_courses" ON "courses"."id" = "books_courses"."course_id" WHERE "books_courses"."book_id" = ?  [["book_id", 1]]

    <%= form.label :categories, style: "display: block" %>
    <%= select_tag(:categories, options_for_select(Category.where("isCourse = false").map {|cat| [cat.name, cat.id]}, :selected => @book.category_ids), {:class => "selectpicker", :include_blank => true,  :multiple => true, :size => 5 })%>
---
SELECT "courses"."id" FROM "courses" INNER JOIN "books_courses" ON "courses"."id" = "books_courses"."course_id" WHERE "books_courses"."book_id" = ?  [["book_id", 1]]