app/views/books/index.html.erb

        <ul id="ul-categories">
          <%= collection_check_boxes(:categories, :category, Category.where("isCourse = false"), :id, :name) do |b|%>
---
SELECT "categories".* FROM "categories" WHERE (isCourse = false)