app/views/books/index.html.erb

          <ul id="ul-categories" style="padding:0px;">
            <%= collection_check_boxes(:categories, :category, Category.all, :id, :name) do |b|%>
---
SELECT "categories".* FROM "categories"