app/views/reservations/_form.html.erb

      <%= form.label :seats, value: "Seat:", style: "display: block; font-weight: bold; width: 100px;" %>
      <%= select_tag(:seats, options_for_select(Seat.all.map {|seat| [seat.name, seat.id]}))%>
---
SELECT "seats".* FROM "seats"