app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)
    authorize! :create, @author, :message => "BEWARE: you are not authorized to create authors"

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "nano"], ["created_at", "2022-09-13 18:33:38.061051"], ["updated_at", "2022-09-13 18:33:38.061051"]]

  def destroy
    authorize! :destroy, @author, :message => "BEWARE: you are not authorized to destroy authors"
    @author.destroy
---
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 7]]