app/controllers/books_controller.rb

  def show
    @authors = Author.joins(:book).where("books.id = (?)", params[:id])
---
SELECT "authors".* FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 1]]

  def update

    @book.author.clear
    @book.category.clear

    for category in params[:categories] do
      @cat = Category.find(category)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]