app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT "books".* FROM "books" ORDER BY "books"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def filter

    query = params[:search]
    @books = Book.where("title LIKE (?)", "%#{query}%").or(Book.where(ISBN: params[:search]))

    if(params[:checkCourse] == "Your Course of study" )
      @books =  @books.joins(:course).where("courses.id = (?)", current_user.course_id)
---
SELECT "books".* FROM "books" WHERE (title LIKE ('%%') OR "books"."ISBN" = ?)  [["ISBN", nil]]
SELECT "books".* FROM "books" INNER JOIN "books_courses" ON "books_courses"."book_id" = "books"."id" INNER JOIN "courses" ON "courses"."id" = "books_courses"."course_id" WHERE (title LIKE ('%%') OR "books"."ISBN" = ?) AND (courses.id = (2))  [["ISBN", nil]]

  def show
    #autorizzazione a leggere
    id = params[:id]
		@book = Book.find(id)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def addToFavorites
    @user = current_user
    @book  = Book.find(params[:id])

    authorize! :addToFauvorites, @book, :message => "BEWARE: you are not authorized to add to favorites books."

    if @user.book.where(id: @book.id).blank?
      @user.book << @book
      added = true
    else
      @user.book.delete(@book)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]

  def removeFromFavorites
    @user = current_user
    @book  = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)
    #autorizzazione a creare
    authorize! :create, @book, :message => "BEWARE: you are not authorized to create new books."

    if  params[:categories].present?
      for category in params[:categories] do
        @cat = Category.find(category)
        @book.category << @cat
      end
    end

    if  params[:courses].present?
      for course in params[:courses] do
        @course = Course.find(course)
        @book.course << @course
      end
    end

    if params[:authors].present?
      for author in params[:authors] do
        @aut = Author.find(author)
---
SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "books" ("ISBN", "title", "created_at", "updated_at", "description", "stock") VALUES (?, ?, ?, ?, ?, ?)  [["ISBN", 3333333333333], ["title", "sssss"], ["created_at", "2022-09-13 12:14:17.819743"], ["updated_at", "2022-09-13 12:14:17.819743"], ["description", "sssss"], ["stock", 3]]
SELECT "courses".* FROM "courses"
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "authors".* FROM "authors"
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update

    authorize! :edit, @book, :message => "BEWARE: you are not authorized to edit books."

    @book.author.clear
    @book.category.clear
    @book.course.clear

    for category in params[:categories] do
      @cat = Category.find(category)
      @book.category << @cat
    end

    for author in params[:authors] do
      @aut = Author.find(author)
      @book.author << @aut
    end

    for course in params[:courses] do
      @cou = Course.find(course)
      @book.course << @cou
    end


    respond_to do |format|
      if @book.update(book_params)
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 4]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "updated_at" = ? WHERE "books"."id" = ?  [["updated_at", "2022-06-25 10:58:03.471249"], ["id", 1]]

  def destroy
    authorize! :destroy, @book, :message => "BEWARE: you are not authorized to destroy books."

    @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 4]]