app/controllers/book_rentals_controller.rb

SELECT "book_rentals".* FROM "book_rentals"
---
  def index
    @book_rentals = BookRental.all

SELECT "books".* FROM "books" WHERE "books"."ISBN" = ? LIMIT ?  [["ISBN", 9788808064851], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "book_rentals" ("book_id", "user_id", "created_at", "updated_at", "startDate", "endDate", "calendar_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book_rental = BookRental.new(book_rental_params)

    isbn_book = params[:book_rental][:ISBN]
    @book = Book.find_by(ISBN: isbn_book)

    #Da implementare con autenticazione
    #@user = current_user
    #id_user = params[:user_id]
    id_user = 1
    @user = User.find(id_user)

    if @book.present?
      @book_rental = @book.book_rental.create(book_rental_params)

DELETE FROM "book_rentals" WHERE "book_rentals"."id" = ?  [["id", 1]]
---
  def destroy
    @book_rental.destroy

SELECT "book_rentals".* FROM "book_rentals" WHERE "book_rentals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_book_rental
      @book_rental = BookRental.find(params[:id])