app/controllers/book_rentals_controller.rb

SELECT "book_rentals".* FROM "book_rentals" WHERE "book_rentals"."user_id" = ?  [["user_id", 5]]
---
  def index
    if current_user.admin?
      @book_rentals = BookRental.all
    else
      @book_rentals = BookRental.where(user_id: current_user.id)