app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def filter

    @books = Book.first

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "books" ("ISBN", "title", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?, ?)
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def create
    @book = Book.new(book_params)

    for category in params[:categories] do
      @cat = Category.find(category)
      @book.category << @cat
    end

    for author in params[:authors] do
      @aut = Author.find(author)
      @book.author << @aut
    end



    respond_to do |format|
      if @book.save

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update

    @book.author.clear
    @book.category.clear

    for category in params[:categories] do
      @cat = Category.find(category)
      @book.category << @cat
    end

    for author in params[:authors] do
      @aut = Author.find(author)