app/controllers/bulletins_controller.rb

SELECT "bulletins".* FROM "bulletins" ORDER BY bulletins.created_at DESC
---
  def index
    @bulletins = Bulletin.all.order('bulletins.created_at DESC')

SELECT "bulletins".* FROM "bulletins" WHERE "bulletins"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_bulletin
      @bulletin = Bulletin.find(params[:id])