app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at", "isCourse") VALUES (?, ?, ?, ?)  [["name", "Ingegneria Informatica"], ["created_at", "2022-06-25 14:56:28.477692"], ["updated_at", "2022-06-25 14:56:28.477692"], ["isCourse", nil]]