app/controllers/reservations_controller.rb

  def index
    if current_user.admin?
      @reservations = Reservation.all
    else
      @reservations = Reservation.where(user_id: current_user.id)
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 8]]

  def create
    @reservation = Reservation.new(reservation_params)

    authorize! :create, @reservation, :message => "BEWARE: you are not authorized to create reservations."
    @check = true

    seat_id = params[:seats]
    @seat = Seat.find(seat_id)

    if @seat.available

      @user = User.find_by(email: params[:reservation][:email])

      if @reservation.present?
        #@reservation = @seat.reservation.create(reservation_params)
        @reservation.seat_id = @seat.id
        if @user.present?
          @reservation.user_id = @user.id
        else
          @check = false
        end
        if @reservation.startDate.present?
---
SELECT "seats".* FROM "seats" WHERE "seats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "seats".* FROM "seats"
SELECT 1 AS one FROM "reservations" WHERE "reservations"."user_id" = ? AND "reservations"."id" != ? AND "reservations"."seat_id" = ? LIMIT ?  [["user_id", 4], ["id", 1], ["seat_id", 1], ["LIMIT", 1]]