app/controllers/reservations_controller.rb

  def create
    @reservation = Reservation.new(reservation_params)

    seat_id = params[:seats]
    @seat = Seat.find(seat_id)

    @user = current_user

    if @reservation.present?
      #@reservation = @seat.reservation.create(reservation_params)
      @reservation.seat_id = @seat.id
      @reservation.user_id = @user.id
    end

    @reservation.startDate = Date.today

    respond_to do |format|
      if @reservation.save
---
SELECT "seats".* FROM "seats" WHERE "seats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reservations" ("seat_id", "user_id", "datetime", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["seat_id", 1], ["user_id", 4], ["datetime", nil], ["created_at", "2022-09-10 15:58:07.118604"], ["updated_at", "2022-09-10 15:58:07.118604"]]

  def update
    respond_to do |format|
      if @reservation.update(reservation_params)
---
UPDATE "reservations" SET "updated_at" = ?, "endDate" = ? WHERE "reservations"."id" = ?  [["updated_at", "2022-09-10 17:04:41.581947"], ["endDate", "2022-09-13 14:30:00"], ["id", 1]]