app/controllers/seats_controller.rb

  def index
    @seats = Seat.all
---
SELECT "seats".* FROM "seats"

  def create
    @seat = Seat.new(seat_params)

    respond_to do |format|
      if @seat.save
---
INSERT INTO "seats" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "1"], ["description", "free"], ["created_at", "2022-09-10 15:48:29.174241"], ["updated_at", "2022-09-10 15:48:29.174241"]]

    def set_seat
      @seat = Seat.find(params[:id])
---
SELECT "seats".* FROM "seats" WHERE "seats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]