app/controllers/secondhands_controller.rb

SELECT "secondhands".* FROM "secondhands"
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @secondhands = Secondhand.all
    for secondhand in @secondhands do
      @book_info = Book.find(secondhand.book_id)

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book_info = Book.find(@secondhand.book_id)

SELECT "books".* FROM "books" WHERE (ISBN) LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "secondhands" ("book_id", "user_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["book_id", 1], ["user_id", 1], ["description", "Libro bello. libro fresco"], ["created_at", "2022-06-23 14:03:42.100803"], ["updated_at", "2022-06-23 14:03:42.100803"]]
INSERT INTO "secondhands" ("book_id", "user_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["book_id", 1], ["user_id", 1], ["description", "Libro bello. libro fresco"], ["created_at", "2022-06-23 15:20:28.125881"], ["updated_at", "2022-06-23 15:20:28.125881"]]
UPDATE "secondhands" SET "updated_at" = ? WHERE "secondhands"."id" = ?  [["updated_at", "2022-06-23 15:20:28.144235"], ["id", 10]]
---
  def create
    isbn_book = params[:secondhand][:ISBN]
    #@book = Book.find_by("ISBN", isbn_book)
    @book = Book.find_by(ISBN: isbn_book)

    #Da implementare con autenticazione
    #@user = current_user
    #id_user = params[:user_id]
    id_user = 1
    @user = User.find(id_user)

    @secondhand = @book.secondhand.create(secondhand_params)
    @secondhand.user_id = @user.id
    @secondhand.book_id = @book.id

    respond_to do |format|
      if @secondhand.save

UPDATE "secondhands" SET "description" = ?, "updated_at" = ?, "approved" = ? WHERE "secondhands"."id" = ?  [["description", "Analisi 1 in vendita"], ["updated_at", "2022-09-15 12:46:13.073141"], ["approved", 0], ["id", 45]]
---
  def update
    respond_to do |format|
      if @secondhand.update(secondhand_params)

DELETE FROM "secondhands" WHERE "secondhands"."id" = ?  [["id", 9]]
---
  def destroy
    @secondhand.destroy

SELECT "books".* FROM "books" INNER JOIN "books_courses" ON "books_courses"."book_id" = "books"."id" INNER JOIN "courses" ON "courses"."id" = "books_courses"."course_id" WHERE (courses.id = (2))
SELECT "secondhands".* FROM "secondhands" INNER JOIN "books" ON "books"."id" = "secondhands"."book_id" WHERE (books.title LIKE ('%%') OR books.ISBN = ('')) AND (book_id in (1,3,2))
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "secondhands".* FROM "secondhands" WHERE "secondhands"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def filter
    query = params[:search]

    @secondhands = Secondhand.joins(:book).where("books.title LIKE (?)", "%#{query}%").or(Secondhand.joins(:book).where("books.ISBN = (?)", params[:search] ))

    if(params[:checkCourse] == "Corso di studi" )
      #Da implementare con autenticazione

    elsif (params[:checkCourse] == "Categorie")
      @books = Book.joins(:category).where("categories.id in (?)", params[:categories][:category])
      @secondhands = @secondhands.where("book_id in (?)", @books.map {|book| book.id})
    else
      #Da implementare con autenticazione
    end

    for secondhand in @secondhands do
      @book_info = Book.find(secondhand.book_id)

SELECT "secondhands".* FROM "secondhands" WHERE "secondhands"."id" = ? LIMIT ?  [["id", 46], ["LIMIT", 1]]
---
    def set_secondhand
      @secondhand = Secondhand.find(params[:id])