app/controllers/secondhands_controller.rb

  def filter
    query = params[:search]

    @secondhands = Secondhand.joins(:book).where("books.title LIKE (?)", "%#{query}%").or(Secondhand.joins(:book).where("books.ISBN = (?)", params[:search] ))

    if(params[:checkCourse] == "Your Course of study" )
      #Da implementare con autenticazione

    elsif (params[:checkCourse] == "Categories")
      @books = Book.joins(:category).where("categories.id in (?)", params[:categories][:category])
      @secondhands = @secondhands.where("book_id in (?)", @books.map {|book| book.id})
    else
      #Da implementare con autenticazione
    end

    for secondhand in @secondhands do
      @book_info = Book.find(secondhand.book_id)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]