app/controllers/secondhands_controller.rb

  def display_to_approve
    @secondhands = Secondhand.where(approved: false)
---
SELECT "secondhands".* FROM "secondhands" WHERE "secondhands"."approved" = ?  [["approved", 0]]

  def approved
    @secondhands = Secondhand.where(approved: true)
---
SELECT "secondhands".* FROM "secondhands" WHERE "secondhands"."approved" = ?  [["approved", 1]]

  def display_my_adv
    #Da completare
    @secondhands = Secondhand.where(user_id: current_user.id)
---
SELECT "secondhands".* FROM "secondhands" WHERE "secondhands"."user_id" = ?  [["user_id", 6]]

  def approve
    authorize! :approve, @secondhand, :message => "BEWARE: you are not authorized to approve secondhands"

    already_approved = false
    if @secondhand.approved == true
      already_approved = true
    end
    @secondhand.approved = true


    respond_to do |format|
      if already_approved == false && @secondhand.save
---
UPDATE "secondhands" SET "updated_at" = ?, "approved" = ? WHERE "secondhands"."id" = ?  [["updated_at", "2022-09-15 12:48:19.627264"], ["approved", 1], ["id", 45]]

  def filter
    query = params[:search]

    @secondhands = Secondhand.joins(:book).where("books.title LIKE (?)", "%#{query}%").or(Secondhand.joins(:book).where("books.ISBN = (?)", params[:search] ))

    if(params[:checkCourse] == "Your Course of study" )
      @books =  Book.joins(:course).where("courses.id = (?)", current_user.course_id)


    elsif (params[:checkCourse] == "All" )
      @books = Book.all

    elsif (params[:checkCourse] == "Favorites" )
      @books = current_user.book.where("title LIKE (?)", "%#{query}%").or(Book.where(ISBN: params[:search]))
    elsif (params[:checkCourse] == "Categories")
      @books = Book.joins(:category).where("categories.id in (?)", params[:categories][:category])

    end



    @secondhands = @secondhands.where("book_id in (?)", @books.map {|book| book.id})
---
SELECT "secondhands".* FROM "secondhands" INNER JOIN "books" ON "books"."id" = "secondhands"."book_id" WHERE (books.title LIKE ('%%') OR books.ISBN = ('')) AND (book_id in (1,3,2))
SELECT "books".* FROM "books" INNER JOIN "books_courses" ON "books_courses"."book_id" = "books"."id" INNER JOIN "courses" ON "courses"."id" = "books_courses"."course_id" WHERE (courses.id = (2))
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "secondhands".* FROM "secondhands" WHERE "secondhands"."id" = ? LIMIT ?  [["id", 46], ["LIMIT", 1]]