app/controllers/ticket_mailer_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "dddd@gmail.com"], ["LIMIT", 1]]
---
    def send_email

        to = params[:to]

        if User.find_by(email: to).blank?