app/controllers/users_controller.rb

    def update
      @user = current_user

      if params[:course_id].present?
        @user.course_id = params[:course_id]
      end

      respond_to do |format|
        if @user.update(user_params)
---
UPDATE "users" SET "matricola" = ?, "updated_at" = ?, "name" = ?, "surname" = ? WHERE "users"."id" = ?  [["matricola", 1886952], ["updated_at", "2022-09-15 10:43:35.490618"], ["name", ""], ["surname", ""], ["id", 7]]