app/models/user.rb

    def self.from_omniauth(auth)
        where(provider: auth.provider, uid: auth.uid).first_or_create do |user|
---
INSERT INTO "users" ("matricola", "email", "created_at", "updated_at", "roles_mask", "uid", "provider", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "name", "surname", "course_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "google_oauth2"], ["uid", "112166134868786849684"], ["LIMIT", 1]]

    def self.new_with_session(params, session)
        super.tap do |user|
            if data = session["devise.google_data"] && session["devise.google_data"]["extra"]["raw_info"]
                user.email = data["email"] if user.email.blank?
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "librarianassi@gmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "oddi.valerio0109@gmail.com"], ["LIMIT", 1]]