app/views/secondhands/_form.html.erb

    <%if secondhand.book_id.present? %>
      <%= form.text_field :ISBN,  value: Book.find(secondhand.book_id).ISBN %>
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]