app/views/secondhands/_secondhand.html.erb


      <% if secondhand.user.matricola.present?%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]