app/views/secondhands/index.html.erb

SELECT "categories".* FROM "categories"
---
            <ul id="ul-categories" style="padding:0px;">
              <%= collection_check_boxes(:categories, :category, Category.all, :id, :name) do |b|%>