app/controllers/users/omniauth_callbacks_controller.rb

INSERT INTO "users" ("matricola", "email", "created_at", "updated_at", "roles_mask", "uid", "provider", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "name", "surname", "course_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "updated_at" = ?, "uid" = ?, "provider" = ? WHERE "users"."id" = ?  [["updated_at", "2022-09-12 19:06:08.767699"], ["uid", "116410270886563231317"], ["provider", "google_oauth2"], ["id", 5]]
---
  def google_oauth2
    @user = User.from_omniauth(auth)
    if @user.present?
      @user.save