app/views/book_rentals/new.html.erb

SELECT "books".* FROM "books" WHERE "books"."ISBN" = ? LIMIT ?  [["ISBN", 9788808420206], ["LIMIT", 1]]
---
  isbn_book = params[:ISBN]
  @book = Book.find_by(ISBN: isbn_book)